GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.inc
// Register: SMT1PRU
#define SMT1PRU SMT1PRU
SMT1PRU                                  equ 0497h
// bitfield definitions
SMT1PRU_SMT1PR_POSN                      equ 0000h
SMT1PRU_SMT1PR_POSITION                  equ 0000h
SMT1PRU_SMT1PR_SIZE                      equ 0008h
SMT1PRU_SMT1PR_LENGTH                    equ 0008h
SMT1PRU_SMT1PR_MASK                      equ 00FFh
SMT1PRU_SMT1PR16_POSN                    equ 0000h
SMT1PRU_SMT1PR16_POSITION                equ 0000h
SMT1PRU_SMT1PR16_SIZE                    equ 0001h
SMT1PRU_SMT1PR16_LENGTH                  equ 0001h
SMT1PRU_SMT1PR16_MASK                    equ 0001h
SMT1PRU_SMT1PR17_POSN                    equ 0001h
SMT1PRU_SMT1PR17_POSITION                equ 0001h
SMT1PRU_SMT1PR17_SIZE                    equ 0001h
SMT1PRU_SMT1PR17_LENGTH                  equ 0001h
SMT1PRU_SMT1PR17_MASK                    equ 0002h
SMT1PRU_SMT1PR18_POSN                    equ 0002h
SMT1PRU_SMT1PR18_POSITION                equ 0002h
SMT1PRU_SMT1PR18_SIZE                    equ 0001h
SMT1PRU_SMT1PR18_LENGTH                  equ 0001h
SMT1PRU_SMT1PR18_MASK                    equ 0004h
SMT1PRU_SMT1PR19_POSN                    equ 0003h
SMT1PRU_SMT1PR19_POSITION                equ 0003h
SMT1PRU_SMT1PR19_SIZE                    equ 0001h
SMT1PRU_SMT1PR19_LENGTH                  equ 0001h
SMT1PRU_SMT1PR19_MASK                    equ 0008h
SMT1PRU_SMT1PR20_POSN                    equ 0004h
SMT1PRU_SMT1PR20_POSITION                equ 0004h
SMT1PRU_SMT1PR20_SIZE                    equ 0001h
SMT1PRU_SMT1PR20_LENGTH                  equ 0001h
SMT1PRU_SMT1PR20_MASK                    equ 0010h
SMT1PRU_SMT1PR21_POSN                    equ 0005h
SMT1PRU_SMT1PR21_POSITION                equ 0005h
SMT1PRU_SMT1PR21_SIZE                    equ 0001h
SMT1PRU_SMT1PR21_LENGTH                  equ 0001h
SMT1PRU_SMT1PR21_MASK                    equ 0020h
SMT1PRU_SMT1PR22_POSN                    equ 0006h
SMT1PRU_SMT1PR22_POSITION                equ 0006h
SMT1PRU_SMT1PR22_SIZE                    equ 0001h
SMT1PRU_SMT1PR22_LENGTH                  equ 0001h
SMT1PRU_SMT1PR22_MASK                    equ 0040h
SMT1PRU_SMT1PR23_POSN                    equ 0007h
SMT1PRU_SMT1PR23_POSITION                equ 0007h
SMT1PRU_SMT1PR23_SIZE                    equ 0001h
SMT1PRU_SMT1PR23_LENGTH                  equ 0001h
SMT1PRU_SMT1PR23_MASK                    equ 0080h

// Register: SMT1CON0
#define SMT1CON0 SMT1CON0
SMT1CON0                                 equ 0498h
// bitfield definitions
SMT1CON0_SMT1PS_POSN                     equ 0000h
SMT1CON0_SMT1PS_POSITION                 equ 0000h
SMT1CON0_SMT1PS_SIZE                     equ 0002h
SMT1CON0_SMT1PS_LENGTH                   equ 0002h
SMT1CON0_SMT1PS_MASK                     equ 0003h
SMT1CON0_CPOL_POSN                       equ 0002h
SMT1CON0_CPOL_POSITION                   equ 0002h
SMT1CON0_CPOL_SIZE                       equ 0001h
SMT1CON0_CPOL_LENGTH                     equ 0001h
SMT1CON0_CPOL_MASK                       equ 0004h
SMT1CON0_SPOL_POSN                       equ 0003h
SMT1CON0_SPOL_POSITION                   equ 0003h
SMT1CON0_SPOL_SIZE                       equ 0001h
SMT1CON0_SPOL_LENGTH                     equ 0001h
SMT1CON0_SPOL_MASK                       equ 0008h
SMT1CON0_WPOL_POSN                       equ 0004h
SMT1CON0_WPOL_POSITION                   equ 0004h
SMT1CON0_WPOL_SIZE                       equ 0001h
SMT1CON0_WPOL_LENGTH                     equ 0001h
SMT1CON0_WPOL_MASK                       equ 0010h
SMT1CON0_STP_POSN                        equ 0005h
SMT1CON0_STP_POSITION                    equ 0005h
SMT1CON0_STP_SIZE                        equ 0001h
SMT1CON0_STP_LENGTH                      equ 0001h
SMT1CON0_STP_MASK                        equ 0020h
SMT1CON0_EN_POSN                         equ 0007h
SMT1CON0_EN_POSITION                     equ 0007h
SMT1CON0_EN_SIZE                         equ 0001h
SMT1CON0_EN_LENGTH                       equ 0001h
SMT1CON0_EN_MASK                         equ 0080h
SMT1CON0_SMT1PS0_POSN                    equ 0000h
SMT1CON0_SMT1PS0_POSITION                equ 0000h
SMT1CON0_SMT1PS0_SIZE                    equ 0001h
SMT1CON0_SMT1PS0_LENGTH                  equ 0001h
SMT1CON0_SMT1PS0_MASK                    equ 0001h
SMT1CON0_SMT1PS1_POSN                    equ 0001h
SMT1CON0_SMT1PS1_POSITION                equ 0001h
SMT1CON0_SMT1PS1_SIZE                    equ 0001h
SMT1CON0_SMT1PS1_LENGTH                  equ 0001h
SMT1CON0_SMT1PS1_MASK                    equ 0002h
SMT1CON0_SMT1EN_POSN                     equ 0007h
SMT1CON0_SMT1EN_POSITION                 equ 0007h
SMT1CON0_SMT1EN_SIZE                     equ 0001h
SMT1CON0_SMT1EN_LENGTH                   equ 0001h
SMT1CON0_SMT1EN_MASK                     equ 0080h

// Register: SMT1CON1
#define SMT1CON1 SMT1CON1
SMT1CON1                                 equ 0499h
// bitfield definitions
SMT1CON1_MODE_POSN                       equ 0000h
SMT1CON1_MODE_POSITION                   equ 0000h
SMT1CON1_MODE_SIZE                       equ 0004h
SMT1CON1_MODE_LENGTH                     equ 0004h
SMT1CON1_MODE_MASK                       equ 000Fh
SMT1CON1_REPEAT_POSN                     equ 0006h
SMT1CON1_REPEAT_POSITION                 equ 0006h
SMT1CON1_REPEAT_SIZE                     equ 0001h
SMT1CON1_REPEAT_LENGTH                   equ 0001h
SMT1CON1_REPEAT_MASK                     equ 0040h
SMT1CON1_SMT1GO_POSN                     equ 0007h
SMT1CON1_SMT1GO_POSITION                 equ 0007h
SMT1CON1_SMT1GO_SIZE                     equ 0001h
SMT1CON1_SMT1GO_LENGTH                   equ 0001h
SMT1CON1_SMT1GO_MASK                     equ 0080h
SMT1CON1_MODE0_POSN                      equ 0000h
SMT1CON1_MODE0_POSITION                  equ 0000h
SMT1CON1_MODE0_SIZE                      equ 0001h
SMT1CON1_MODE0_LENGTH                    equ 0001h
SMT1CON1_MODE0_MASK                      equ 0001h
SMT1CON1_MODE1_POSN                      equ 0001h
SMT1CON1_MODE1_POSITION                  equ 0001h
SMT1CON1_MODE1_SIZE                      equ 0001h
SMT1CON1_MODE1_LENGTH                    equ 0001h
SMT1CON1_MODE1_MASK                      equ 0002h
SMT1CON1_MODE2_POSN                      equ 0002h
SMT1CON1_MODE2_POSITION                  equ 0002h
SMT1CON1_MODE2_SIZE                      equ 0001h
SMT1CON1_MODE2_LENGTH                    equ 0001h
SMT1CON1_MODE2_MASK                      equ 0004h
SMT1CON1_MODE3_POSN                      equ 0003h
SMT1CON1_MODE3_POSITION                  equ 0003h
SMT1CON1_MODE3_SIZE                      equ 0001h
SMT1CON1_MODE3_LENGTH                    equ 0001h
SMT1CON1_MODE3_MASK                      equ 0008h

// Register: SMT1STAT
#define SMT1STAT SMT1STAT
SMT1STAT                                 equ 049Ah
// bitfield definitions
SMT1STAT_AS_POSN                         equ 0000h
SMT1STAT_AS_POSITION                     equ 0000h
SMT1STAT_AS_SIZE                         equ 0001h
SMT1STAT_AS_LENGTH                       equ 0001h
SMT1STAT_AS_MASK                         equ 0001h
SMT1STAT_WS_POSN                         equ 0001h
SMT1STAT_WS_POSITION                     equ 0001h
SMT1STAT_WS_SIZE                         equ 0001h
SMT1STAT_WS_LENGTH                       equ 0001h
SMT1STAT_WS_MASK                         equ 0002h
SMT1STAT_TS_POSN                         equ 0002h
SMT1STAT_TS_POSITION                     equ 0002h
SMT1STAT_TS_SIZE                         equ 0001h
SMT1STAT_TS_LENGTH                       equ 0001h
SMT1STAT_TS_MASK                         equ 0004h
SMT1STAT_RST_POSN                        equ 0005h
SMT1STAT_RST_POSITION                    equ 0005h
SMT1STAT_RST_SIZE                        equ 0001h
SMT1STAT_RST_LENGTH                      equ 0001h
SMT1STAT_RST_MASK                        equ 0020h
SMT1STAT_CPWUP_POSN                      equ 0006h
SMT1STAT_CPWUP_POSITION                  equ 0006h
SMT1STAT_CPWUP_SIZE                      equ 0001h
SMT1STAT_CPWUP_LENGTH                    equ 0001h
SMT1STAT_CPWUP_MASK                      equ 0040h
SMT1STAT_CPRUP_POSN                      equ 0007h
SMT1STAT_CPRUP_POSITION                  equ 0007h
SMT1STAT_CPRUP_SIZE                      equ 0001h
SMT1STAT_CPRUP_LENGTH                    equ 0001h
SMT1STAT_CPRUP_MASK                      equ 0080h
SMT1STAT_SMT1AS_POSN                     equ 0000h
SMT1STAT_SMT1AS_POSITION                 equ 0000h
SMT1STAT_SMT1AS_SIZE                     equ 0001h
SMT1STAT_SMT1AS_LENGTH                   equ 0001h
SMT1STAT_SMT1AS_MASK                     equ 0001h
SMT1STAT_SMT1WS_POSN                     equ 0001h
SMT1STAT_SMT1WS_POSITION                 equ 0001h
SMT1STAT_SMT1WS_SIZE                     equ 0001h
SMT1STAT_SMT1WS_LENGTH                   equ 0001h
SMT1STAT_SMT1WS_MASK                     equ 0002h
SMT1STAT_SMT1TS_POSN                     equ 0002h
SMT1STAT_SMT1TS_POSITION                 equ 0002h
SMT1STAT_SMT1TS_SIZE                     equ 0001h
SMT1STAT_SMT1TS_LENGTH                   equ 0001h
SMT1STAT_SMT1TS_MASK                     equ 0004h
SMT1STAT_SMT1RESET_POSN                  equ 0005h
SMT1STAT_SMT1RESET_POSITION              equ 0005h
SMT1STAT_SMT1RESET_SIZE                  equ 0001h
SMT1STAT_SMT1RESET_LENGTH                equ 0001h
SMT1STAT_SMT1RESET_MASK                  equ 0020h
SMT1STAT_SMT1CPWUP_POSN                  equ 0006h
SMT1STAT_SMT1CPWUP_POSITION              equ 0006h
SMT1STAT_SMT1CPWUP_SIZE                  equ 0001h
SMT1STAT_SMT1CPWUP_LENGTH                equ 0001h
SMT1STAT_SMT1CPWUP_MASK                  equ 0040h
SMT1STAT_SMT1CPRUP_POSN                  equ 0007h
SMT1STAT_SMT1CPRUP_POSITION              equ 0007h
SMT1STAT_SMT1CPRUP_SIZE                  equ 0001h
SMT1STAT_SMT1CPRUP_LENGTH                equ 0001h
SMT1STAT_SMT1CPRUP_MASK                  equ 0080h

// Register: SMT1CLK
#define SMT1CLK SMT1CLK
SMT1CLK                                  equ 049Bh
// bitfield definitions
SMT1CLK_CSEL_POSN                        equ 0000h
SMT1CLK_CSEL_POSITION                    equ 0000h
SMT1CLK_CSEL_SIZE                        equ 0003h
SMT1CLK_CSEL_LENGTH                      equ 0003h
SMT1CLK_CSEL_MASK                        equ 0007h
SMT1CLK_CSEL0_POSN                       equ 0000h
SMT1CLK_CSEL0_POSITION                   equ 0000h
SMT1CLK_CSEL0_SIZE                       equ 0001h
SMT1CLK_CSEL0_LENGTH                     equ 0001h
SMT1CLK_CSEL0_MASK                       equ 0001h
SMT1CLK_CSEL1_POSN                       equ 0001h
SMT1CLK_CSEL1_POSITION                   equ 0001h
SMT1CLK_CSEL1_SIZE                       equ 0001h
SMT1CLK_CSEL1_LENGTH                     equ 0001h
SMT1CLK_CSEL1_MASK                       equ 0002h
SMT1CLK_CSEL2_POSN                       equ 0002h
SMT1CLK_CSEL2_POSITION                   equ 0002h
SMT1CLK_CSEL2_SIZE                       equ 0001h
SMT1CLK_CSEL2_LENGTH                     equ 0001h
SMT1CLK_CSEL2_MASK                       equ 0004h
SMT1CLK_SMT1CSEL_POSN                    equ 0000h
SMT1CLK_SMT1CSEL_POSITION                equ 0000h
SMT1CLK_SMT1CSEL_SIZE                    equ 0003h
SMT1CLK_SMT1CSEL_LENGTH                  equ 0003h
SMT1CLK_SMT1CSEL_MASK                    equ 0007h
SMT1CLK_SMT1CSEL0_POSN                   equ 0000h
SMT1CLK_SMT1CSEL0_POSITION               equ 0000h
SMT1CLK_SMT1CSEL0_SIZE                   equ 0001h
SMT1CLK_SMT1CSEL0_LENGTH                 equ 0001h
SMT1CLK_SMT1CSEL0_MASK                   equ 0001h
SMT1CLK_SMT1CSEL1_POSN                   equ 0001h
SMT1CLK_SMT1CSEL1_POSITION               equ 0001h
SMT1CLK_SMT1CSEL1_SIZE                   equ 0001h
SMT1CLK_SMT1CSEL1_LENGTH                 equ 0001h
SMT1CLK_SMT1CSEL1_MASK                   equ 0002h
SMT1CLK_SMT1CSEL2_POSN                   equ 0002h
SMT1CLK_SMT1CSEL2_POSITION               equ 0002h
SMT1CLK_SMT1CSEL2_SIZE                   equ 0001h
SMT1CLK_SMT1CSEL2_LENGTH                 equ 0001h
SMT1CLK_SMT1CSEL2_MASK                   equ 0004h

// Register: SMT1SIG
#define SMT1SIG SMT1SIG
SMT1SIG                                  equ 049Ch
// bitfield definitions
SMT1SIG_SSEL_POSN                        equ 0000h
SMT1SIG_SSEL_POSITION                    equ 0000h
SMT1SIG_SSEL_SIZE                        equ 0005h
SMT1SIG_SSEL_LENGTH                      equ 0005h
SMT1SIG_SSEL_MASK                        equ 001Fh
SMT1SIG_SSEL0_POSN                       equ 0000h
SMT1SIG_SSEL0_POSITION                   equ 0000h
SMT1SIG_SSEL0_SIZE                       equ 0001h
SMT1SIG_SSEL0_LENGTH                     equ 0001h
SMT1SIG_SSEL0_MASK                       equ 0001h
SMT1SIG_SSEL1_POSN                       equ 0001h
SMT1SIG_SSEL1_POSITION                   equ 0001h
SMT1SIG_SSEL1_SIZE                       equ 0001h
SMT1SIG_SSEL1_LENGTH                     equ 0001h
SMT1SIG_SSEL1_MASK                       equ 0002h
SMT1SIG_SSEL2_POSN                       equ 0002h
SMT1SIG_SSEL2_POSITION                   equ 0002h
SMT1SIG_SSEL2_SIZE                       equ 0001h
SMT1SIG_SSEL2_LENGTH                     equ 0001h
SMT1SIG_SSEL2_MASK                       equ 0004h
SMT1SIG_SSEL3_POSN                       equ 0003h
SMT1SIG_SSEL3_POSITION                   equ 0003h
SMT1SIG_SSEL3_SIZE                       equ 0001h
SMT1SIG_SSEL3_LENGTH                     equ 0001h
SMT1SIG_SSEL3_MASK                       equ 0008h
SMT1SIG_SSEL4_POSN                       equ 0004h
SMT1SIG_SSEL4_POSITION                   equ 0004h
SMT1SIG_SSEL4_SIZE                       equ 0001h
SMT1SIG_SSEL4_LENGTH                     equ 0001h
SMT1SIG_SSEL4_MASK                       equ 0010h
SMT1SIG_SMT1SSEL_POSN                    equ 0000h
SMT1SIG_SMT1SSEL_POSITION                equ 0000h
SMT1SIG_SMT1SSEL_SIZE                    equ 0005h
SMT1SIG_SMT1SSEL_LENGTH                  equ 0005h
SMT1SIG_SMT1SSEL_MASK                    equ 001Fh
SMT1SIG_SMT1SSEL0_POSN                   equ 0000h
SMT1SIG_SMT1SSEL0_POSITION               equ 0000h
SMT1SIG_SMT1SSEL0_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL0_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL0_MASK                   equ 0001h
SMT1SIG_SMT1SSEL1_POSN                   equ 0001h
SMT1SIG_SMT1SSEL1_POSITION               equ 0001h
SMT1SIG_SMT1SSEL1_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL1_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL1_MASK                   equ 0002h
SMT1SIG_SMT1SSEL2_POSN                   equ 0002h
SMT1SIG_SMT1SSEL2_POSITION               equ 0002h
SMT1SIG_SMT1SSEL2_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL2_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL2_MASK                   equ 0004h
SMT1SIG_SMT1SSEL3_POSN                   equ 0003h
SMT1SIG_SMT1SSEL3_POSITION               equ 0003h
SMT1SIG_SMT1SSEL3_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL3_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL3_MASK                   equ 0008h
SMT1SIG_SMT1SSEL4_POSN                   equ 0004h
SMT1SIG_SMT1SSEL4_POSITION               equ 0004h
SMT1SIG_SMT1SSEL4_SIZE                   equ 0001h
SMT1SIG_SMT1SSEL4_LENGTH                 equ 0001h
SMT1SIG_SMT1SSEL4_MASK                   equ 0010h

// Register: SMT1WIN
#define SMT1WIN SMT1WIN
SMT1WIN                                  equ 049Dh
// bitfield definitions
SMT1WIN_WSEL_POSN                        equ 0000h
SMT1WIN_WSEL_POSITION                    equ 0000h
SMT1WIN_WSEL_SIZE                        equ 0005h
SMT1WIN_WSEL_LENGTH                      equ 0005h
SMT1WIN_WSEL_MASK                        equ 001Fh
SMT1WIN_WSEL0_POSN                       equ 0000h
SMT1WIN_WSEL0_POSITION                   equ 0000h
SMT1WIN_WSEL0_SIZE                       equ 0001h
SMT1WIN_WSEL0_LENGTH                     equ 0001h
SMT1WIN_WSEL0_MASK                       equ 0001h
SMT1WIN_WSEL1_POSN                       equ 0001h
SMT1WIN_WSEL1_POSITION                   equ 0001h
SMT1WIN_WSEL1_SIZE                       equ 0001h
SMT1WIN_WSEL1_LENGTH                     equ 0001h
SMT1WIN_WSEL1_MASK                       equ 0002h
SMT1WIN_WSEL2_POSN                       equ 0002h
SMT1WIN_WSEL2_POSITION                   equ 0002h
SMT1WIN_WSEL2_SIZE                       equ 0001h
SMT1WIN_WSEL2_LENGTH                     equ 0001h
SMT1WIN_WSEL2_MASK                       equ 0004h
SMT1WIN_WSEL3_POSN                       equ 0003h
SMT1WIN_WSEL3_POSITION                   equ 0003h
SMT1WIN_WSEL3_SIZE                       equ 0001h
SMT1WIN_WSEL3_LENGTH                     equ 0001h
SMT1WIN_WSEL3_MASK                       equ 0008h
SMT1WIN_WSEL4_POSN                       equ 0004h
SMT1WIN_WSEL4_POSITION                   equ 0004h
SMT1WIN_WSEL4_SIZE                       equ 0001h
SMT1WIN_WSEL4_LENGTH                     equ 0001h
SMT1WIN_WSEL4_MASK                       equ 0010h
SMT1WIN_SMT1WSEL_POSN                    equ 0000h
SMT1WIN_SMT1WSEL_POSITION                equ 0000h
SMT1WIN_SMT1WSEL_SIZE                    equ 0005h
SMT1WIN_SMT1WSEL_LENGTH                  equ 0005h
SMT1WIN_SMT1WSEL_MASK                    equ 001Fh
SMT1WIN_SMT1WSEL0_POSN                   equ 0000h
SMT1WIN_SMT1WSEL0_POSITION               equ 0000h
SMT1WIN_SMT1WSEL0_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL0_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL0_MASK                   equ 0001h
SMT1WIN_SMT1WSEL1_POSN                   equ 0001h
SMT1WIN_SMT1WSEL1_POSITION               equ 0001h
SMT1WIN_SMT1WSEL1_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL1_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL1_MASK                   equ 0002h
SMT1WIN_SMT1WSEL2_POSN                   equ 0002h
SMT1WIN_SMT1WSEL2_POSITION               equ 0002h
SMT1WIN_SMT1WSEL2_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL2_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL2_MASK                   equ 0004h
SMT1WIN_SMT1WSEL3_POSN                   equ 0003h
SMT1WIN_SMT1WSEL3_POSITION               equ 0003h
SMT1WIN_SMT1WSEL3_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL3_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL3_MASK                   equ 0008h
SMT1WIN_SMT1WSEL4_POSN                   equ 0004h
SMT1WIN_SMT1WSEL4_POSITION               equ 0004h
SMT1WIN_SMT1WSEL4_SIZE                   equ 0001h
SMT1WIN_SMT1WSEL4_LENGTH                 equ 0001h
SMT1WIN_SMT1WSEL4_MASK                   equ 0010h

// Register: TMR0L
#define TMR0L TMR0L
TMR0L                                    equ 059Ch
// bitfield definitions
TMR0L_TMR0L_POSN                         equ 0000h
TMR0L_TMR0L_POSITION                     equ 0000h
TMR0L_TMR0L_SIZE                         equ 0008h
TMR0L_TMR0L_LENGTH                       equ 0008h
TMR0L_TMR0L_MASK                         equ 00FFh
TMR0L_TMR0L0_POSN                        equ 0000h
TMR0L_TMR0L0_POSITION                    equ 0000h
TMR0L_TMR0L0_SIZE                        equ 0001h
TMR0L_TMR0L0_LENGTH                      equ 0001h
TMR0L_TMR0L0_MASK                        equ 0001h
TMR0L_TMR0L1_POSN                        equ 0001h
TMR0L_TMR0L1_POSITION                    equ 0001h
TMR0L_TMR0L1_SIZE                        equ 0001h
TMR0L_TMR0L1_LENGTH                      equ 0001h
TMR0L_TMR0L1_MASK                        equ 0002h
TMR0L_TMR0L2_POSN                        equ 0002h
TMR0L_TMR0L2_POSITION                    equ 0002h
TMR0L_TMR0L2_SIZE                        equ 0001h
TMR0L_TMR0L2_LENGTH                      equ 0001h
TMR0L_TMR0L2_MASK                        equ 0004h
TMR0L_TMR0L3_POSN                        equ 0003h
TMR0L_TMR0L3_POSITION                    equ 0003h
TMR0L_TMR0L3_SIZE                        equ 0001h
TMR0L_TMR0L3_LENGTH                      equ 0001h
TMR0L_TMR0L3_MASK                        equ 0008h
TMR0L_TMR0L4_POSN                        equ 0004h
TMR0L_TMR0L4_POSITION                    equ 0004h
TMR0L_TMR0L4_SIZE                        equ 0001h
TMR0L_TMR0L4_LENGTH                      equ 0001h
TMR0L_TMR0L4_MASK                        equ 0010h
TMR0L_TMR0L5_POSN                        equ 0005h
TMR0L_TMR0L5_POSITION                    equ 0005h
TMR0L_TMR0L5_SIZE                        equ 0001h
TMR0L_TMR0L5_LENGTH                      equ 0001h
TMR0L_TMR0L5_MASK                        equ 0020h
TMR0L_TMR0L6_POSN                        equ 0006h
TMR0L_TMR0L6_POSITION                    equ 0006h
TMR0L_TMR0L6_SIZE                        equ 0001h
TMR0L_TMR0L6_LENGTH                      equ 0001h
TMR0L_TMR0L6_MASK                        equ 0040h
TMR0L_TMR0L7_POSN                        equ 0007h
TMR0L_TMR0L7_POSITION                    equ 0007h
TMR0L_TMR0L7_SIZE                        equ 0001h
TMR0L_TMR0L7_LENGTH                      equ 0001h
TMR0L_TMR0L7_MASK                        equ 0080h

