GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 01D2Ch
// bitfield definitions
LCDDATA20_S18C3_POSN                     equ 0002h
LCDDATA20_S18C3_POSITION                 equ 0002h
LCDDATA20_S18C3_SIZE                     equ 0001h
LCDDATA20_S18C3_LENGTH                   equ 0001h
LCDDATA20_S18C3_MASK                     equ 0004h
LCDDATA20_S19C3_POSN                     equ 0003h
LCDDATA20_S19C3_POSITION                 equ 0003h
LCDDATA20_S19C3_SIZE                     equ 0001h
LCDDATA20_S19C3_LENGTH                   equ 0001h
LCDDATA20_S19C3_MASK                     equ 0008h
LCDDATA20_S20C3_POSN                     equ 0004h
LCDDATA20_S20C3_POSITION                 equ 0004h
LCDDATA20_S20C3_SIZE                     equ 0001h
LCDDATA20_S20C3_LENGTH                   equ 0001h
LCDDATA20_S20C3_MASK                     equ 0010h
LCDDATA20_S22C3_POSN                     equ 0006h
LCDDATA20_S22C3_POSITION                 equ 0006h
LCDDATA20_S22C3_SIZE                     equ 0001h
LCDDATA20_S22C3_LENGTH                   equ 0001h
LCDDATA20_S22C3_MASK                     equ 0040h
LCDDATA20_S23C3_POSN                     equ 0007h
LCDDATA20_S23C3_POSITION                 equ 0007h
LCDDATA20_S23C3_SIZE                     equ 0001h
LCDDATA20_S23C3_LENGTH                   equ 0001h
LCDDATA20_S23C3_MASK                     equ 0080h

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
LCDDATA21                                equ 01D2Dh
// bitfield definitions
LCDDATA21_S24C3_POSN                     equ 0000h
LCDDATA21_S24C3_POSITION                 equ 0000h
LCDDATA21_S24C3_SIZE                     equ 0001h
LCDDATA21_S24C3_LENGTH                   equ 0001h
LCDDATA21_S24C3_MASK                     equ 0001h
LCDDATA21_S25C3_POSN                     equ 0001h
LCDDATA21_S25C3_POSITION                 equ 0001h
LCDDATA21_S25C3_SIZE                     equ 0001h
LCDDATA21_S25C3_LENGTH                   equ 0001h
LCDDATA21_S25C3_MASK                     equ 0002h
LCDDATA21_S26C3_POSN                     equ 0002h
LCDDATA21_S26C3_POSITION                 equ 0002h
LCDDATA21_S26C3_SIZE                     equ 0001h
LCDDATA21_S26C3_LENGTH                   equ 0001h
LCDDATA21_S26C3_MASK                     equ 0004h
LCDDATA21_S27C3_POSN                     equ 0003h
LCDDATA21_S27C3_POSITION                 equ 0003h
LCDDATA21_S27C3_SIZE                     equ 0001h
LCDDATA21_S27C3_LENGTH                   equ 0001h
LCDDATA21_S27C3_MASK                     equ 0008h
LCDDATA21_S28C3_POSN                     equ 0004h
LCDDATA21_S28C3_POSITION                 equ 0004h
LCDDATA21_S28C3_SIZE                     equ 0001h
LCDDATA21_S28C3_LENGTH                   equ 0001h
LCDDATA21_S28C3_MASK                     equ 0010h
LCDDATA21_S29C3_POSN                     equ 0005h
LCDDATA21_S29C3_POSITION                 equ 0005h
LCDDATA21_S29C3_SIZE                     equ 0001h
LCDDATA21_S29C3_LENGTH                   equ 0001h
LCDDATA21_S29C3_MASK                     equ 0020h
LCDDATA21_S30C3_POSN                     equ 0006h
LCDDATA21_S30C3_POSITION                 equ 0006h
LCDDATA21_S30C3_SIZE                     equ 0001h
LCDDATA21_S30C3_LENGTH                   equ 0001h
LCDDATA21_S30C3_MASK                     equ 0040h
LCDDATA21_S31C3_POSN                     equ 0007h
LCDDATA21_S31C3_POSITION                 equ 0007h
LCDDATA21_S31C3_SIZE                     equ 0001h
LCDDATA21_S31C3_LENGTH                   equ 0001h
LCDDATA21_S31C3_MASK                     equ 0080h

// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
LCDDATA22                                equ 01D2Eh
// bitfield definitions
LCDDATA22_S32C3_POSN                     equ 0000h
LCDDATA22_S32C3_POSITION                 equ 0000h
LCDDATA22_S32C3_SIZE                     equ 0001h
LCDDATA22_S32C3_LENGTH                   equ 0001h
LCDDATA22_S32C3_MASK                     equ 0001h
LCDDATA22_S33C3_POSN                     equ 0001h
LCDDATA22_S33C3_POSITION                 equ 0001h
LCDDATA22_S33C3_SIZE                     equ 0001h
LCDDATA22_S33C3_LENGTH                   equ 0001h
LCDDATA22_S33C3_MASK                     equ 0002h
LCDDATA22_S34C3_POSN                     equ 0002h
LCDDATA22_S34C3_POSITION                 equ 0002h
LCDDATA22_S34C3_SIZE                     equ 0001h
LCDDATA22_S34C3_LENGTH                   equ 0001h
LCDDATA22_S34C3_MASK                     equ 0004h

// Register: LCDDATA24
#define LCDDATA24 LCDDATA24
LCDDATA24                                equ 01D30h
// bitfield definitions
LCDDATA24_S00C4_POSN                     equ 0000h
LCDDATA24_S00C4_POSITION                 equ 0000h
LCDDATA24_S00C4_SIZE                     equ 0001h
LCDDATA24_S00C4_LENGTH                   equ 0001h
LCDDATA24_S00C4_MASK                     equ 0001h
LCDDATA24_S01C4_POSN                     equ 0001h
LCDDATA24_S01C4_POSITION                 equ 0001h
LCDDATA24_S01C4_SIZE                     equ 0001h
LCDDATA24_S01C4_LENGTH                   equ 0001h
LCDDATA24_S01C4_MASK                     equ 0002h
LCDDATA24_S02C4_POSN                     equ 0002h
LCDDATA24_S02C4_POSITION                 equ 0002h
LCDDATA24_S02C4_SIZE                     equ 0001h
LCDDATA24_S02C4_LENGTH                   equ 0001h
LCDDATA24_S02C4_MASK                     equ 0004h
LCDDATA24_S03C4_POSN                     equ 0003h
LCDDATA24_S03C4_POSITION                 equ 0003h
LCDDATA24_S03C4_SIZE                     equ 0001h
LCDDATA24_S03C4_LENGTH                   equ 0001h
LCDDATA24_S03C4_MASK                     equ 0008h
LCDDATA24_S04C4_POSN                     equ 0004h
LCDDATA24_S04C4_POSITION                 equ 0004h
LCDDATA24_S04C4_SIZE                     equ 0001h
LCDDATA24_S04C4_LENGTH                   equ 0001h
LCDDATA24_S04C4_MASK                     equ 0010h
LCDDATA24_S06C4_POSN                     equ 0006h
LCDDATA24_S06C4_POSITION                 equ 0006h
LCDDATA24_S06C4_SIZE                     equ 0001h
LCDDATA24_S06C4_LENGTH                   equ 0001h
LCDDATA24_S06C4_MASK                     equ 0040h
LCDDATA24_S07C4_POSN                     equ 0007h
LCDDATA24_S07C4_POSITION                 equ 0007h
LCDDATA24_S07C4_SIZE                     equ 0001h
LCDDATA24_S07C4_LENGTH                   equ 0001h
LCDDATA24_S07C4_MASK                     equ 0080h

// Register: LCDDATA25
#define LCDDATA25 LCDDATA25
LCDDATA25                                equ 01D31h
// bitfield definitions
LCDDATA25_S08C4_POSN                     equ 0000h
LCDDATA25_S08C4_POSITION                 equ 0000h
LCDDATA25_S08C4_SIZE                     equ 0001h
LCDDATA25_S08C4_LENGTH                   equ 0001h
LCDDATA25_S08C4_MASK                     equ 0001h
LCDDATA25_S09C4_POSN                     equ 0001h
LCDDATA25_S09C4_POSITION                 equ 0001h
LCDDATA25_S09C4_SIZE                     equ 0001h
LCDDATA25_S09C4_LENGTH                   equ 0001h
LCDDATA25_S09C4_MASK                     equ 0002h
LCDDATA25_S10C4_POSN                     equ 0002h
LCDDATA25_S10C4_POSITION                 equ 0002h
LCDDATA25_S10C4_SIZE                     equ 0001h
LCDDATA25_S10C4_LENGTH                   equ 0001h
LCDDATA25_S10C4_MASK                     equ 0004h
LCDDATA25_S11C4_POSN                     equ 0003h
LCDDATA25_S11C4_POSITION                 equ 0003h
LCDDATA25_S11C4_SIZE                     equ 0001h
LCDDATA25_S11C4_LENGTH                   equ 0001h
LCDDATA25_S11C4_MASK                     equ 0008h
LCDDATA25_S13C4_POSN                     equ 0005h
LCDDATA25_S13C4_POSITION                 equ 0005h
LCDDATA25_S13C4_SIZE                     equ 0001h
LCDDATA25_S13C4_LENGTH                   equ 0001h
LCDDATA25_S13C4_MASK                     equ 0020h
LCDDATA25_S14C4_POSN                     equ 0006h
LCDDATA25_S14C4_POSITION                 equ 0006h
LCDDATA25_S14C4_SIZE                     equ 0001h
LCDDATA25_S14C4_LENGTH                   equ 0001h
LCDDATA25_S14C4_MASK                     equ 0040h
LCDDATA25_S15C4_POSN                     equ 0007h
LCDDATA25_S15C4_POSITION                 equ 0007h
LCDDATA25_S15C4_SIZE                     equ 0001h
LCDDATA25_S15C4_LENGTH                   equ 0001h
LCDDATA25_S15C4_MASK                     equ 0080h

// Register: LCDDATA26
#define LCDDATA26 LCDDATA26
LCDDATA26                                equ 01D32h
// bitfield definitions
LCDDATA26_S18C4_POSN                     equ 0002h
LCDDATA26_S18C4_POSITION                 equ 0002h
LCDDATA26_S18C4_SIZE                     equ 0001h
LCDDATA26_S18C4_LENGTH                   equ 0001h
LCDDATA26_S18C4_MASK                     equ 0004h
LCDDATA26_S19C4_POSN                     equ 0003h
LCDDATA26_S19C4_POSITION                 equ 0003h
LCDDATA26_S19C4_SIZE                     equ 0001h
LCDDATA26_S19C4_LENGTH                   equ 0001h
LCDDATA26_S19C4_MASK                     equ 0008h
LCDDATA26_S20C4_POSN                     equ 0004h
LCDDATA26_S20C4_POSITION                 equ 0004h
LCDDATA26_S20C4_SIZE                     equ 0001h
LCDDATA26_S20C4_LENGTH                   equ 0001h
LCDDATA26_S20C4_MASK                     equ 0010h
LCDDATA26_S22C4_POSN                     equ 0006h
LCDDATA26_S22C4_POSITION                 equ 0006h
LCDDATA26_S22C4_SIZE                     equ 0001h
LCDDATA26_S22C4_LENGTH                   equ 0001h
LCDDATA26_S22C4_MASK                     equ 0040h
LCDDATA26_S23C4_POSN                     equ 0007h
LCDDATA26_S23C4_POSITION                 equ 0007h
LCDDATA26_S23C4_SIZE                     equ 0001h
LCDDATA26_S23C4_LENGTH                   equ 0001h
LCDDATA26_S23C4_MASK                     equ 0080h

// Register: LCDDATA27
#define LCDDATA27 LCDDATA27
LCDDATA27                                equ 01D33h
// bitfield definitions
LCDDATA27_S24C4_POSN                     equ 0000h
LCDDATA27_S24C4_POSITION                 equ 0000h
LCDDATA27_S24C4_SIZE                     equ 0001h
LCDDATA27_S24C4_LENGTH                   equ 0001h
LCDDATA27_S24C4_MASK                     equ 0001h
LCDDATA27_S25C4_POSN                     equ 0001h
LCDDATA27_S25C4_POSITION                 equ 0001h
LCDDATA27_S25C4_SIZE                     equ 0001h
LCDDATA27_S25C4_LENGTH                   equ 0001h
LCDDATA27_S25C4_MASK                     equ 0002h
LCDDATA27_S26C4_POSN                     equ 0002h
LCDDATA27_S26C4_POSITION                 equ 0002h
LCDDATA27_S26C4_SIZE                     equ 0001h
LCDDATA27_S26C4_LENGTH                   equ 0001h
LCDDATA27_S26C4_MASK                     equ 0004h
LCDDATA27_S27C4_POSN                     equ 0003h
LCDDATA27_S27C4_POSITION                 equ 0003h
LCDDATA27_S27C4_SIZE                     equ 0001h
LCDDATA27_S27C4_LENGTH                   equ 0001h
LCDDATA27_S27C4_MASK                     equ 0008h
LCDDATA27_S28C4_POSN                     equ 0004h
LCDDATA27_S28C4_POSITION                 equ 0004h
LCDDATA27_S28C4_SIZE                     equ 0001h
LCDDATA27_S28C4_LENGTH                   equ 0001h
LCDDATA27_S28C4_MASK                     equ 0010h
LCDDATA27_S29C4_POSN                     equ 0005h
LCDDATA27_S29C4_POSITION                 equ 0005h
LCDDATA27_S29C4_SIZE                     equ 0001h
LCDDATA27_S29C4_LENGTH                   equ 0001h
LCDDATA27_S29C4_MASK                     equ 0020h
LCDDATA27_S30C4_POSN                     equ 0006h
LCDDATA27_S30C4_POSITION                 equ 0006h
LCDDATA27_S30C4_SIZE                     equ 0001h
LCDDATA27_S30C4_LENGTH                   equ 0001h
LCDDATA27_S30C4_MASK                     equ 0040h
LCDDATA27_S31C4_POSN                     equ 0007h
LCDDATA27_S31C4_POSITION                 equ 0007h
LCDDATA27_S31C4_SIZE                     equ 0001h
LCDDATA27_S31C4_LENGTH                   equ 0001h
LCDDATA27_S31C4_MASK                     equ 0080h

// Register: LCDDATA28
#define LCDDATA28 LCDDATA28
LCDDATA28                                equ 01D34h
// bitfield definitions
LCDDATA28_S32C4_POSN                     equ 0000h
LCDDATA28_S32C4_POSITION                 equ 0000h
LCDDATA28_S32C4_SIZE                     equ 0001h
LCDDATA28_S32C4_LENGTH                   equ 0001h
LCDDATA28_S32C4_MASK                     equ 0001h
LCDDATA28_S33C4_POSN                     equ 0001h
LCDDATA28_S33C4_POSITION                 equ 0001h
LCDDATA28_S33C4_SIZE                     equ 0001h
LCDDATA28_S33C4_LENGTH                   equ 0001h
LCDDATA28_S33C4_MASK                     equ 0002h
LCDDATA28_S34C4_POSN                     equ 0002h
LCDDATA28_S34C4_POSITION                 equ 0002h
LCDDATA28_S34C4_SIZE                     equ 0001h
LCDDATA28_S34C4_LENGTH                   equ 0001h
LCDDATA28_S34C4_MASK                     equ 0004h

// Register: LCDDATA30
#define LCDDATA30 LCDDATA30
LCDDATA30                                equ 01D36h
// bitfield definitions
LCDDATA30_S00C5_POSN                     equ 0000h
LCDDATA30_S00C5_POSITION                 equ 0000h
LCDDATA30_S00C5_SIZE                     equ 0001h
LCDDATA30_S00C5_LENGTH                   equ 0001h
LCDDATA30_S00C5_MASK                     equ 0001h
LCDDATA30_S01C5_POSN                     equ 0001h
LCDDATA30_S01C5_POSITION                 equ 0001h
LCDDATA30_S01C5_SIZE                     equ 0001h
LCDDATA30_S01C5_LENGTH                   equ 0001h
LCDDATA30_S01C5_MASK                     equ 0002h
LCDDATA30_S02C5_POSN                     equ 0002h
LCDDATA30_S02C5_POSITION                 equ 0002h
LCDDATA30_S02C5_SIZE                     equ 0001h
LCDDATA30_S02C5_LENGTH                   equ 0001h
LCDDATA30_S02C5_MASK                     equ 0004h
LCDDATA30_S03C5_POSN                     equ 0003h
LCDDATA30_S03C5_POSITION                 equ 0003h
LCDDATA30_S03C5_SIZE                     equ 0001h
LCDDATA30_S03C5_LENGTH                   equ 0001h
LCDDATA30_S03C5_MASK                     equ 0008h
LCDDATA30_S04C5_POSN                     equ 0004h
LCDDATA30_S04C5_POSITION                 equ 0004h
LCDDATA30_S04C5_SIZE                     equ 0001h
LCDDATA30_S04C5_LENGTH                   equ 0001h
LCDDATA30_S04C5_MASK                     equ 0010h
LCDDATA30_S06C5_POSN                     equ 0006h
LCDDATA30_S06C5_POSITION                 equ 0006h
LCDDATA30_S06C5_SIZE                     equ 0001h
LCDDATA30_S06C5_LENGTH                   equ 0001h
LCDDATA30_S06C5_MASK                     equ 0040h
LCDDATA30_S07C5_POSN                     equ 0007h
LCDDATA30_S07C5_POSITION                 equ 0007h
LCDDATA30_S07C5_SIZE                     equ 0001h
LCDDATA30_S07C5_LENGTH                   equ 0001h
LCDDATA30_S07C5_MASK                     equ 0080h

// Register: LCDDATA31
#define LCDDATA31 LCDDATA31
LCDDATA31                                equ 01D37h
// bitfield definitions
LCDDATA31_S08C5_POSN                     equ 0000h
LCDDATA31_S08C5_POSITION                 equ 0000h
LCDDATA31_S08C5_SIZE                     equ 0001h
LCDDATA31_S08C5_LENGTH                   equ 0001h
LCDDATA31_S08C5_MASK                     equ 0001h
LCDDATA31_S09C5_POSN                     equ 0001h
LCDDATA31_S09C5_POSITION                 equ 0001h
LCDDATA31_S09C5_SIZE                     equ 0001h
LCDDATA31_S09C5_LENGTH                   equ 0001h
LCDDATA31_S09C5_MASK                     equ 0002h
LCDDATA31_S10C5_POSN                     equ 0002h
LCDDATA31_S10C5_POSITION                 equ 0002h
LCDDATA31_S10C5_SIZE                     equ 0001h
LCDDATA31_S10C5_LENGTH                   equ 0001h
LCDDATA31_S10C5_MASK                     equ 0004h
LCDDATA31_S11C5_POSN                     equ 0003h
LCDDATA31_S11C5_POSITION                 equ 0003h
LCDDATA31_S11C5_SIZE                     equ 0001h
LCDDATA31_S11C5_LENGTH                   equ 0001h
LCDDATA31_S11C5_MASK                     equ 0008h
LCDDATA31_S13C5_POSN                     equ 0005h
LCDDATA31_S13C5_POSITION                 equ 0005h
LCDDATA31_S13C5_SIZE                     equ 0001h
LCDDATA31_S13C5_LENGTH                   equ 0001h
LCDDATA31_S13C5_MASK                     equ 0020h
LCDDATA31_S14C5_POSN                     equ 0006h
LCDDATA31_S14C5_POSITION                 equ 0006h
LCDDATA31_S14C5_SIZE                     equ 0001h
LCDDATA31_S14C5_LENGTH                   equ 0001h
LCDDATA31_S14C5_MASK                     equ 0040h
LCDDATA31_S15C5_POSN                     equ 0007h
LCDDATA31_S15C5_POSITION                 equ 0007h
LCDDATA31_S15C5_SIZE                     equ 0001h
LCDDATA31_S15C5_LENGTH                   equ 0001h
LCDDATA31_S15C5_MASK                     equ 0080h

// Register: LCDDATA32
#define LCDDATA32 LCDDATA32
LCDDATA32                                equ 01D38h
// bitfield definitions
LCDDATA32_S18C5_POSN                     equ 0002h
LCDDATA32_S18C5_POSITION                 equ 0002h
LCDDATA32_S18C5_SIZE                     equ 0001h
LCDDATA32_S18C5_LENGTH                   equ 0001h
LCDDATA32_S18C5_MASK                     equ 0004h
LCDDATA32_S19C5_POSN                     equ 0003h
LCDDATA32_S19C5_POSITION                 equ 0003h
LCDDATA32_S19C5_SIZE                     equ 0001h
LCDDATA32_S19C5_LENGTH                   equ 0001h
LCDDATA32_S19C5_MASK                     equ 0008h
LCDDATA32_S20C5_POSN                     equ 0004h
LCDDATA32_S20C5_POSITION                 equ 0004h
LCDDATA32_S20C5_SIZE                     equ 0001h
LCDDATA32_S20C5_LENGTH                   equ 0001h
LCDDATA32_S20C5_MASK                     equ 0010h
LCDDATA32_S22C5_POSN                     equ 0006h
LCDDATA32_S22C5_POSITION                 equ 0006h
LCDDATA32_S22C5_SIZE                     equ 0001h
LCDDATA32_S22C5_LENGTH                   equ 0001h
LCDDATA32_S22C5_MASK                     equ 0040h
LCDDATA32_S23C5_POSN                     equ 0007h
LCDDATA32_S23C5_POSITION                 equ 0007h
LCDDATA32_S23C5_SIZE                     equ 0001h
LCDDATA32_S23C5_LENGTH                   equ 0001h
LCDDATA32_S23C5_MASK                     equ 0080h

// Register: LCDDATA33
#define LCDDATA33 LCDDATA33
LCDDATA33                                equ 01D39h
// bitfield definitions
LCDDATA33_S24C5_POSN                     equ 0000h
LCDDATA33_S24C5_POSITION                 equ 0000h
LCDDATA33_S24C5_SIZE                     equ 0001h
LCDDATA33_S24C5_LENGTH                   equ 0001h
LCDDATA33_S24C5_MASK                     equ 0001h
LCDDATA33_S25C5_POSN                     equ 0001h
LCDDATA33_S25C5_POSITION                 equ 0001h
LCDDATA33_S25C5_SIZE                     equ 0001h
LCDDATA33_S25C5_LENGTH                   equ 0001h
LCDDATA33_S25C5_MASK                     equ 0002h
LCDDATA33_S26C5_POSN                     equ 0002h
LCDDATA33_S26C5_POSITION                 equ 0002h
LCDDATA33_S26C5_SIZE                     equ 0001h
LCDDATA33_S26C5_LENGTH                   equ 0001h
LCDDATA33_S26C5_MASK                     equ 0004h
LCDDATA33_S27C5_POSN                     equ 0003h
LCDDATA33_S27C5_POSITION                 equ 0003h
LCDDATA33_S27C5_SIZE                     equ 0001h
LCDDATA33_S27C5_LENGTH                   equ 0001h
LCDDATA33_S27C5_MASK                     equ 0008h
LCDDATA33_S28C5_POSN                     equ 0004h
LCDDATA33_S28C5_POSITION                 equ 0004h
LCDDATA33_S28C5_SIZE                     equ 0001h
LCDDATA33_S28C5_LENGTH                   equ 0001h
LCDDATA33_S28C5_MASK                     equ 0010h
LCDDATA33_S29C5_POSN                     equ 0005h
LCDDATA33_S29C5_POSITION                 equ 0005h
LCDDATA33_S29C5_SIZE                     equ 0001h
LCDDATA33_S29C5_LENGTH                   equ 0001h
LCDDATA33_S29C5_MASK                     equ 0020h
LCDDATA33_S30C5_POSN                     equ 0006h
LCDDATA33_S30C5_POSITION                 equ 0006h
LCDDATA33_S30C5_SIZE                     equ 0001h
LCDDATA33_S30C5_LENGTH                   equ 0001h
LCDDATA33_S30C5_MASK                     equ 0040h
LCDDATA33_S31C5_POSN                     equ 0007h
LCDDATA33_S31C5_POSITION                 equ 0007h
LCDDATA33_S31C5_SIZE                     equ 0001h
LCDDATA33_S31C5_LENGTH                   equ 0001h
LCDDATA33_S31C5_MASK                     equ 0080h

