GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.inc
// Register: LCDDATA43
#define LCDDATA43 LCDDATA43
LCDDATA43                                equ 01D43h
// bitfield definitions
LCDDATA43_S08C7_POSN                     equ 0000h
LCDDATA43_S08C7_POSITION                 equ 0000h
LCDDATA43_S08C7_SIZE                     equ 0001h
LCDDATA43_S08C7_LENGTH                   equ 0001h
LCDDATA43_S08C7_MASK                     equ 0001h
LCDDATA43_S09C7_POSN                     equ 0001h
LCDDATA43_S09C7_POSITION                 equ 0001h
LCDDATA43_S09C7_SIZE                     equ 0001h
LCDDATA43_S09C7_LENGTH                   equ 0001h
LCDDATA43_S09C7_MASK                     equ 0002h
LCDDATA43_S10C7_POSN                     equ 0002h
LCDDATA43_S10C7_POSITION                 equ 0002h
LCDDATA43_S10C7_SIZE                     equ 0001h
LCDDATA43_S10C7_LENGTH                   equ 0001h
LCDDATA43_S10C7_MASK                     equ 0004h
LCDDATA43_S11C7_POSN                     equ 0003h
LCDDATA43_S11C7_POSITION                 equ 0003h
LCDDATA43_S11C7_SIZE                     equ 0001h
LCDDATA43_S11C7_LENGTH                   equ 0001h
LCDDATA43_S11C7_MASK                     equ 0008h
LCDDATA43_S13C7_POSN                     equ 0005h
LCDDATA43_S13C7_POSITION                 equ 0005h
LCDDATA43_S13C7_SIZE                     equ 0001h
LCDDATA43_S13C7_LENGTH                   equ 0001h
LCDDATA43_S13C7_MASK                     equ 0020h
LCDDATA43_S14C7_POSN                     equ 0006h
LCDDATA43_S14C7_POSITION                 equ 0006h
LCDDATA43_S14C7_SIZE                     equ 0001h
LCDDATA43_S14C7_LENGTH                   equ 0001h
LCDDATA43_S14C7_MASK                     equ 0040h
LCDDATA43_S15C7_POSN                     equ 0007h
LCDDATA43_S15C7_POSITION                 equ 0007h
LCDDATA43_S15C7_SIZE                     equ 0001h
LCDDATA43_S15C7_LENGTH                   equ 0001h
LCDDATA43_S15C7_MASK                     equ 0080h

// Register: LCDDATA44
#define LCDDATA44 LCDDATA44
LCDDATA44                                equ 01D44h
// bitfield definitions
LCDDATA44_S18C7_POSN                     equ 0002h
LCDDATA44_S18C7_POSITION                 equ 0002h
LCDDATA44_S18C7_SIZE                     equ 0001h
LCDDATA44_S18C7_LENGTH                   equ 0001h
LCDDATA44_S18C7_MASK                     equ 0004h
LCDDATA44_S19C7_POSN                     equ 0003h
LCDDATA44_S19C7_POSITION                 equ 0003h
LCDDATA44_S19C7_SIZE                     equ 0001h
LCDDATA44_S19C7_LENGTH                   equ 0001h
LCDDATA44_S19C7_MASK                     equ 0008h
LCDDATA44_S20C7_POSN                     equ 0004h
LCDDATA44_S20C7_POSITION                 equ 0004h
LCDDATA44_S20C7_SIZE                     equ 0001h
LCDDATA44_S20C7_LENGTH                   equ 0001h
LCDDATA44_S20C7_MASK                     equ 0010h
LCDDATA44_S22C7_POSN                     equ 0006h
LCDDATA44_S22C7_POSITION                 equ 0006h
LCDDATA44_S22C7_SIZE                     equ 0001h
LCDDATA44_S22C7_LENGTH                   equ 0001h
LCDDATA44_S22C7_MASK                     equ 0040h
LCDDATA44_S23C7_POSN                     equ 0007h
LCDDATA44_S23C7_POSITION                 equ 0007h
LCDDATA44_S23C7_SIZE                     equ 0001h
LCDDATA44_S23C7_LENGTH                   equ 0001h
LCDDATA44_S23C7_MASK                     equ 0080h

// Register: LCDDATA45
#define LCDDATA45 LCDDATA45
LCDDATA45                                equ 01D45h
// bitfield definitions
LCDDATA45_S24C7_POSN                     equ 0000h
LCDDATA45_S24C7_POSITION                 equ 0000h
LCDDATA45_S24C7_SIZE                     equ 0001h
LCDDATA45_S24C7_LENGTH                   equ 0001h
LCDDATA45_S24C7_MASK                     equ 0001h
LCDDATA45_S25C7_POSN                     equ 0001h
LCDDATA45_S25C7_POSITION                 equ 0001h
LCDDATA45_S25C7_SIZE                     equ 0001h
LCDDATA45_S25C7_LENGTH                   equ 0001h
LCDDATA45_S25C7_MASK                     equ 0002h
LCDDATA45_S26C7_POSN                     equ 0002h
LCDDATA45_S26C7_POSITION                 equ 0002h
LCDDATA45_S26C7_SIZE                     equ 0001h
LCDDATA45_S26C7_LENGTH                   equ 0001h
LCDDATA45_S26C7_MASK                     equ 0004h
LCDDATA45_S27C7_POSN                     equ 0003h
LCDDATA45_S27C7_POSITION                 equ 0003h
LCDDATA45_S27C7_SIZE                     equ 0001h
LCDDATA45_S27C7_LENGTH                   equ 0001h
LCDDATA45_S27C7_MASK                     equ 0008h
LCDDATA45_S28C7_POSN                     equ 0004h
LCDDATA45_S28C7_POSITION                 equ 0004h
LCDDATA45_S28C7_SIZE                     equ 0001h
LCDDATA45_S28C7_LENGTH                   equ 0001h
LCDDATA45_S28C7_MASK                     equ 0010h
LCDDATA45_S29C7_POSN                     equ 0005h
LCDDATA45_S29C7_POSITION                 equ 0005h
LCDDATA45_S29C7_SIZE                     equ 0001h
LCDDATA45_S29C7_LENGTH                   equ 0001h
LCDDATA45_S29C7_MASK                     equ 0020h
LCDDATA45_S30C7_POSN                     equ 0006h
LCDDATA45_S30C7_POSITION                 equ 0006h
LCDDATA45_S30C7_SIZE                     equ 0001h
LCDDATA45_S30C7_LENGTH                   equ 0001h
LCDDATA45_S30C7_MASK                     equ 0040h
LCDDATA45_S31C7_POSN                     equ 0007h
LCDDATA45_S31C7_POSITION                 equ 0007h
LCDDATA45_S31C7_SIZE                     equ 0001h
LCDDATA45_S31C7_LENGTH                   equ 0001h
LCDDATA45_S31C7_MASK                     equ 0080h

// Register: LCDDATA46
#define LCDDATA46 LCDDATA46
LCDDATA46                                equ 01D46h
// bitfield definitions
LCDDATA46_S32C7_POSN                     equ 0000h
LCDDATA46_S32C7_POSITION                 equ 0000h
LCDDATA46_S32C7_SIZE                     equ 0001h
LCDDATA46_S32C7_LENGTH                   equ 0001h
LCDDATA46_S32C7_MASK                     equ 0001h
LCDDATA46_S33C7_POSN                     equ 0001h
LCDDATA46_S33C7_POSITION                 equ 0001h
LCDDATA46_S33C7_SIZE                     equ 0001h
LCDDATA46_S33C7_LENGTH                   equ 0001h
LCDDATA46_S33C7_MASK                     equ 0002h
LCDDATA46_S34C7_POSN                     equ 0002h
LCDDATA46_S34C7_POSITION                 equ 0002h
LCDDATA46_S34C7_SIZE                     equ 0001h
LCDDATA46_S34C7_LENGTH                   equ 0001h
LCDDATA46_S34C7_MASK                     equ 0004h

// Register: CLCDATA
#define CLCDATA CLCDATA
CLCDATA                                  equ 01E0Fh
// bitfield definitions
CLCDATA_MLC1OUT_POSN                     equ 0000h
CLCDATA_MLC1OUT_POSITION                 equ 0000h
CLCDATA_MLC1OUT_SIZE                     equ 0001h
CLCDATA_MLC1OUT_LENGTH                   equ 0001h
CLCDATA_MLC1OUT_MASK                     equ 0001h
CLCDATA_MLC2OUT_POSN                     equ 0001h
CLCDATA_MLC2OUT_POSITION                 equ 0001h
CLCDATA_MLC2OUT_SIZE                     equ 0001h
CLCDATA_MLC2OUT_LENGTH                   equ 0001h
CLCDATA_MLC2OUT_MASK                     equ 0002h
CLCDATA_MLC3OUT_POSN                     equ 0002h
CLCDATA_MLC3OUT_POSITION                 equ 0002h
CLCDATA_MLC3OUT_SIZE                     equ 0001h
CLCDATA_MLC3OUT_LENGTH                   equ 0001h
CLCDATA_MLC3OUT_MASK                     equ 0004h
CLCDATA_MLC4OUT_POSN                     equ 0003h
CLCDATA_MLC4OUT_POSITION                 equ 0003h
CLCDATA_MLC4OUT_SIZE                     equ 0001h
CLCDATA_MLC4OUT_LENGTH                   equ 0001h
CLCDATA_MLC4OUT_MASK                     equ 0008h

