GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.inc
// Register: RD3PPS
#define RD3PPS RD3PPS
RD3PPS                                   equ 01F2Bh
// bitfield definitions
RD3PPS_RD3PPS_POSN                       equ 0000h
RD3PPS_RD3PPS_POSITION                   equ 0000h
RD3PPS_RD3PPS_SIZE                       equ 0005h
RD3PPS_RD3PPS_LENGTH                     equ 0005h
RD3PPS_RD3PPS_MASK                       equ 001Fh

// Register: RD4PPS
#define RD4PPS RD4PPS
RD4PPS                                   equ 01F2Ch
// bitfield definitions
RD4PPS_RD4PPS_POSN                       equ 0000h
RD4PPS_RD4PPS_POSITION                   equ 0000h
RD4PPS_RD4PPS_SIZE                       equ 0005h
RD4PPS_RD4PPS_LENGTH                     equ 0005h
RD4PPS_RD4PPS_MASK                       equ 001Fh

// Register: RD5PPS
#define RD5PPS RD5PPS
RD5PPS                                   equ 01F2Dh
// bitfield definitions
RD5PPS_RD5PPS_POSN                       equ 0000h
RD5PPS_RD5PPS_POSITION                   equ 0000h
RD5PPS_RD5PPS_SIZE                       equ 0005h
RD5PPS_RD5PPS_LENGTH                     equ 0005h
RD5PPS_RD5PPS_MASK                       equ 001Fh

// Register: RD6PPS
#define RD6PPS RD6PPS
RD6PPS                                   equ 01F2Eh
// bitfield definitions
RD6PPS_RD6PPS_POSN                       equ 0000h
RD6PPS_RD6PPS_POSITION                   equ 0000h
RD6PPS_RD6PPS_SIZE                       equ 0005h
RD6PPS_RD6PPS_LENGTH                     equ 0005h
RD6PPS_RD6PPS_MASK                       equ 001Fh

// Register: RD7PPS
#define RD7PPS RD7PPS
RD7PPS                                   equ 01F2Fh
// bitfield definitions
RD7PPS_RD7PPS_POSN                       equ 0000h
RD7PPS_RD7PPS_POSITION                   equ 0000h
RD7PPS_RD7PPS_SIZE                       equ 0005h
RD7PPS_RD7PPS_LENGTH                     equ 0005h
RD7PPS_RD7PPS_MASK                       equ 001Fh

// Register: RE0PPS
#define RE0PPS RE0PPS
RE0PPS                                   equ 01F30h
// bitfield definitions
RE0PPS_RE0PPS_POSN                       equ 0000h
RE0PPS_RE0PPS_POSITION                   equ 0000h
RE0PPS_RE0PPS_SIZE                       equ 0005h
RE0PPS_RE0PPS_LENGTH                     equ 0005h
RE0PPS_RE0PPS_MASK                       equ 001Fh

// Register: RE1PPS
#define RE1PPS RE1PPS
RE1PPS                                   equ 01F31h
// bitfield definitions
RE1PPS_RE1PPS_POSN                       equ 0000h
RE1PPS_RE1PPS_POSITION                   equ 0000h
RE1PPS_RE1PPS_SIZE                       equ 0005h
RE1PPS_RE1PPS_LENGTH                     equ 0005h
RE1PPS_RE1PPS_MASK                       equ 001Fh

// Register: RE2PPS
#define RE2PPS RE2PPS
RE2PPS                                   equ 01F32h
// bitfield definitions
RE2PPS_RE2PPS_POSN                       equ 0000h
RE2PPS_RE2PPS_POSITION                   equ 0000h
RE2PPS_RE2PPS_SIZE                       equ 0005h
RE2PPS_RE2PPS_LENGTH                     equ 0005h
RE2PPS_RE2PPS_MASK                       equ 001Fh

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 01F38h
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA3_POSN                        equ 0003h
ANSELA_ANSA3_POSITION                    equ 0003h
ANSELA_ANSA3_SIZE                        equ 0001h
ANSELA_ANSA3_LENGTH                      equ 0001h
ANSELA_ANSA3_MASK                        equ 0008h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSA6_POSN                        equ 0006h
ANSELA_ANSA6_POSITION                    equ 0006h
ANSELA_ANSA6_SIZE                        equ 0001h
ANSELA_ANSA6_LENGTH                      equ 0001h
ANSELA_ANSA6_MASK                        equ 0040h
ANSELA_ANSA7_POSN                        equ 0007h
ANSELA_ANSA7_POSITION                    equ 0007h
ANSELA_ANSA7_SIZE                        equ 0001h
ANSELA_ANSA7_LENGTH                      equ 0001h
ANSELA_ANSA7_MASK                        equ 0080h

// Register: WPUA
#define WPUA WPUA
WPUA                                     equ 01F39h
// bitfield definitions
WPUA_WPUA0_POSN                          equ 0000h
WPUA_WPUA0_POSITION                      equ 0000h
WPUA_WPUA0_SIZE                          equ 0001h
WPUA_WPUA0_LENGTH                        equ 0001h
WPUA_WPUA0_MASK                          equ 0001h
WPUA_WPUA1_POSN                          equ 0001h
WPUA_WPUA1_POSITION                      equ 0001h
WPUA_WPUA1_SIZE                          equ 0001h
WPUA_WPUA1_LENGTH                        equ 0001h
WPUA_WPUA1_MASK                          equ 0002h
WPUA_WPUA2_POSN                          equ 0002h
WPUA_WPUA2_POSITION                      equ 0002h
WPUA_WPUA2_SIZE                          equ 0001h
WPUA_WPUA2_LENGTH                        equ 0001h
WPUA_WPUA2_MASK                          equ 0004h
WPUA_WPUA3_POSN                          equ 0003h
WPUA_WPUA3_POSITION                      equ 0003h
WPUA_WPUA3_SIZE                          equ 0001h
WPUA_WPUA3_LENGTH                        equ 0001h
WPUA_WPUA3_MASK                          equ 0008h
WPUA_WPUA4_POSN                          equ 0004h
WPUA_WPUA4_POSITION                      equ 0004h
WPUA_WPUA4_SIZE                          equ 0001h
WPUA_WPUA4_LENGTH                        equ 0001h
WPUA_WPUA4_MASK                          equ 0010h
WPUA_WPUA5_POSN                          equ 0005h
WPUA_WPUA5_POSITION                      equ 0005h
WPUA_WPUA5_SIZE                          equ 0001h
WPUA_WPUA5_LENGTH                        equ 0001h
WPUA_WPUA5_MASK                          equ 0020h
WPUA_WPUA6_POSN                          equ 0006h
WPUA_WPUA6_POSITION                      equ 0006h
WPUA_WPUA6_SIZE                          equ 0001h
WPUA_WPUA6_LENGTH                        equ 0001h
WPUA_WPUA6_MASK                          equ 0040h
WPUA_WPUA7_POSN                          equ 0007h
WPUA_WPUA7_POSITION                      equ 0007h
WPUA_WPUA7_SIZE                          equ 0001h
WPUA_WPUA7_LENGTH                        equ 0001h
WPUA_WPUA7_MASK                          equ 0080h

// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 01F3Ah
// bitfield definitions
ODCONA_ODCA0_POSN                        equ 0000h
ODCONA_ODCA0_POSITION                    equ 0000h
ODCONA_ODCA0_SIZE                        equ 0001h
ODCONA_ODCA0_LENGTH                      equ 0001h
ODCONA_ODCA0_MASK                        equ 0001h
ODCONA_ODCA1_POSN                        equ 0001h
ODCONA_ODCA1_POSITION                    equ 0001h
ODCONA_ODCA1_SIZE                        equ 0001h
ODCONA_ODCA1_LENGTH                      equ 0001h
ODCONA_ODCA1_MASK                        equ 0002h
ODCONA_ODCA2_POSN                        equ 0002h
ODCONA_ODCA2_POSITION                    equ 0002h
ODCONA_ODCA2_SIZE                        equ 0001h
ODCONA_ODCA2_LENGTH                      equ 0001h
ODCONA_ODCA2_MASK                        equ 0004h
ODCONA_ODCA3_POSN                        equ 0003h
ODCONA_ODCA3_POSITION                    equ 0003h
ODCONA_ODCA3_SIZE                        equ 0001h
ODCONA_ODCA3_LENGTH                      equ 0001h
ODCONA_ODCA3_MASK                        equ 0008h
ODCONA_ODCA4_POSN                        equ 0004h
ODCONA_ODCA4_POSITION                    equ 0004h
ODCONA_ODCA4_SIZE                        equ 0001h
ODCONA_ODCA4_LENGTH                      equ 0001h
ODCONA_ODCA4_MASK                        equ 0010h
ODCONA_ODCA6_POSN                        equ 0006h
ODCONA_ODCA6_POSITION                    equ 0006h
ODCONA_ODCA6_SIZE                        equ 0001h
ODCONA_ODCA6_LENGTH                      equ 0001h
ODCONA_ODCA6_MASK                        equ 0040h
ODCONA_ODCA7_POSN                        equ 0007h
ODCONA_ODCA7_POSITION                    equ 0007h
ODCONA_ODCA7_SIZE                        equ 0001h
ODCONA_ODCA7_LENGTH                      equ 0001h
ODCONA_ODCA7_MASK                        equ 0080h

// Register: SLRCONA
#define SLRCONA SLRCONA
SLRCONA                                  equ 01F3Bh
// bitfield definitions
SLRCONA_SLRA0_POSN                       equ 0000h
SLRCONA_SLRA0_POSITION                   equ 0000h
SLRCONA_SLRA0_SIZE                       equ 0001h
SLRCONA_SLRA0_LENGTH                     equ 0001h
SLRCONA_SLRA0_MASK                       equ 0001h
SLRCONA_SLRA1_POSN                       equ 0001h
SLRCONA_SLRA1_POSITION                   equ 0001h
SLRCONA_SLRA1_SIZE                       equ 0001h
SLRCONA_SLRA1_LENGTH                     equ 0001h
SLRCONA_SLRA1_MASK                       equ 0002h
SLRCONA_SLRA2_POSN                       equ 0002h
SLRCONA_SLRA2_POSITION                   equ 0002h
SLRCONA_SLRA2_SIZE                       equ 0001h
SLRCONA_SLRA2_LENGTH                     equ 0001h
SLRCONA_SLRA2_MASK                       equ 0004h
SLRCONA_SLRA3_POSN                       equ 0003h
SLRCONA_SLRA3_POSITION                   equ 0003h
SLRCONA_SLRA3_SIZE                       equ 0001h
SLRCONA_SLRA3_LENGTH                     equ 0001h
SLRCONA_SLRA3_MASK                       equ 0008h
SLRCONA_SLRA4_POSN                       equ 0004h
SLRCONA_SLRA4_POSITION                   equ 0004h
SLRCONA_SLRA4_SIZE                       equ 0001h
SLRCONA_SLRA4_LENGTH                     equ 0001h
SLRCONA_SLRA4_MASK                       equ 0010h
SLRCONA_SLRA6_POSN                       equ 0006h
SLRCONA_SLRA6_POSITION                   equ 0006h
SLRCONA_SLRA6_SIZE                       equ 0001h
SLRCONA_SLRA6_LENGTH                     equ 0001h
SLRCONA_SLRA6_MASK                       equ 0040h
SLRCONA_SLRA7_POSN                       equ 0007h
SLRCONA_SLRA7_POSITION                   equ 0007h
SLRCONA_SLRA7_SIZE                       equ 0001h
SLRCONA_SLRA7_LENGTH                     equ 0001h
SLRCONA_SLRA7_MASK                       equ 0080h

