GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.inc
#define RES15                            BANKMASK(ADRESH), 7
#define RES2                             BANKMASK(ADRESL), 2
#define RES3                             BANKMASK(ADRESL), 3
#define RES4                             BANKMASK(ADRESL), 4
#define RES5                             BANKMASK(ADRESL), 5
#define RES6                             BANKMASK(ADRESL), 6
#define RES7                             BANKMASK(ADRESL), 7
#define RES8                             BANKMASK(ADRESH), 0
#define RES9                             BANKMASK(ADRESH), 1
#define ROI                              BANKMASK(CPUDOZE), 5
#define RPT0                             BANKMASK(ADRPT), 0
#define RPT1                             BANKMASK(ADRPT), 1
#define RPT2                             BANKMASK(ADRPT), 2
#define RPT3                             BANKMASK(ADRPT), 3
#define RPT4                             BANKMASK(ADRPT), 4
#define RPT5                             BANKMASK(ADRPT), 5
#define RPT6                             BANKMASK(ADRPT), 6
#define RPT7                             BANKMASK(ADRPT), 7
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RST                              BANKMASK(SMT1STAT), 5
#define RTCCIE                           BANKMASK(PIE8), 6
#define RTCCIF                           BANKMASK(PIR8), 6
#define RTCCLKSEL0                       BANKMASK(RTCCON), 0
#define RTCCLKSEL1                       BANKMASK(RTCCON), 1
#define RTCCMD                           BANKMASK(PMD2), 7
#define RTCEN                            BANKMASK(RTCCON), 7
#define RTCSYNC                          BANKMASK(RTCCON), 4
#define RTCWREN                          BANKMASK(RTCCON), 5
#define RW                               BANKMASK(SSP1STAT), 2
#define RW1                              BANKMASK(SSP1STAT), 2
#define RX1PPS0                          BANKMASK(RX1PPS), 0
#define RX1PPS1                          BANKMASK(RX1PPS), 1
#define RX1PPS2                          BANKMASK(RX1PPS), 2
#define RX1PPS3                          BANKMASK(RX1PPS), 3
#define RX1PPS4                          BANKMASK(RX1PPS), 4
#define RX2PPS0                          BANKMASK(RX2PPS), 0
#define RX2PPS1                          BANKMASK(RX2PPS), 1
#define RX3PPS2                          BANKMASK(RX2PPS), 2
#define RX4PPS3                          BANKMASK(RX2PPS), 3
#define RX5PPS4                          BANKMASK(RX2PPS), 4
#define R_W                              BANKMASK(SSP1STAT), 2
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_nW                             BANKMASK(SSP1STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define S00C0                            BANKMASK(LCDDATA0), 0
#define S00C1                            BANKMASK(LCDDATA6), 0
#define S00C2                            BANKMASK(LCDDATA12), 0
#define S00C3                            BANKMASK(LCDDATA18), 0
#define S00C4                            BANKMASK(LCDDATA24), 0
#define S00C5                            BANKMASK(LCDDATA30), 0
#define S00C6                            BANKMASK(LCDDATA36), 0
#define S00C7                            BANKMASK(LCDDATA42), 0
#define S01C0                            BANKMASK(LCDDATA0), 1
#define S01C1                            BANKMASK(LCDDATA6), 1
#define S01C2                            BANKMASK(LCDDATA12), 1
#define S01C3                            BANKMASK(LCDDATA18), 1
#define S01C4                            BANKMASK(LCDDATA24), 1
#define S01C5                            BANKMASK(LCDDATA30), 1
#define S01C6                            BANKMASK(LCDDATA36), 1
#define S01C7                            BANKMASK(LCDDATA42), 1
#define S02C0                            BANKMASK(LCDDATA0), 2
#define S02C1                            BANKMASK(LCDDATA6), 2
#define S02C2                            BANKMASK(LCDDATA12), 2
#define S02C3                            BANKMASK(LCDDATA18), 2
#define S02C4                            BANKMASK(LCDDATA24), 2
#define S02C5                            BANKMASK(LCDDATA30), 2
#define S02C6                            BANKMASK(LCDDATA36), 2
#define S02C7                            BANKMASK(LCDDATA42), 2
#define S03C0                            BANKMASK(LCDDATA0), 3
#define S03C1                            BANKMASK(LCDDATA6), 3
#define S03C2                            BANKMASK(LCDDATA12), 3
#define S03C3                            BANKMASK(LCDDATA18), 3
#define S03C4                            BANKMASK(LCDDATA24), 3
#define S03C5                            BANKMASK(LCDDATA30), 3
#define S03C6                            BANKMASK(LCDDATA36), 3
#define S03C7                            BANKMASK(LCDDATA42), 3
#define S04C0                            BANKMASK(LCDDATA0), 4
#define S04C1                            BANKMASK(LCDDATA6), 4
#define S04C2                            BANKMASK(LCDDATA12), 4
#define S04C3                            BANKMASK(LCDDATA18), 4
#define S04C4                            BANKMASK(LCDDATA24), 4
#define S04C5                            BANKMASK(LCDDATA30), 4
#define S04C6                            BANKMASK(LCDDATA36), 4
#define S04C7                            BANKMASK(LCDDATA42), 4
#define S06C0                            BANKMASK(LCDDATA0), 6
#define S06C1                            BANKMASK(LCDDATA6), 6
#define S06C2                            BANKMASK(LCDDATA12), 6
#define S06C3                            BANKMASK(LCDDATA18), 6
#define S06C4                            BANKMASK(LCDDATA24), 6
#define S06C5                            BANKMASK(LCDDATA30), 6
#define S06C6                            BANKMASK(LCDDATA36), 6
#define S06C7                            BANKMASK(LCDDATA42), 6
#define S07C0                            BANKMASK(LCDDATA0), 7
#define S07C1                            BANKMASK(LCDDATA6), 7
#define S07C2                            BANKMASK(LCDDATA12), 7
#define S07C3                            BANKMASK(LCDDATA18), 7
#define S07C4                            BANKMASK(LCDDATA24), 7
#define S07C5                            BANKMASK(LCDDATA30), 7
#define S07C6                            BANKMASK(LCDDATA36), 7
#define S07C7                            BANKMASK(LCDDATA42), 7
#define S08C0                            BANKMASK(LCDDATA1), 0
#define S08C1                            BANKMASK(LCDDATA7), 0
#define S08C2                            BANKMASK(LCDDATA13), 0
#define S08C3                            BANKMASK(LCDDATA19), 0
#define S08C4                            BANKMASK(LCDDATA25), 0
#define S08C5                            BANKMASK(LCDDATA31), 0
#define S08C6                            BANKMASK(LCDDATA37), 0
#define S08C7                            BANKMASK(LCDDATA43), 0
#define S09C0                            BANKMASK(LCDDATA1), 1
#define S09C1                            BANKMASK(LCDDATA7), 1
#define S09C2                            BANKMASK(LCDDATA13), 1
#define S09C3                            BANKMASK(LCDDATA19), 1
#define S09C4                            BANKMASK(LCDDATA25), 1
#define S09C5                            BANKMASK(LCDDATA31), 1
#define S09C6                            BANKMASK(LCDDATA37), 1
#define S09C7                            BANKMASK(LCDDATA43), 1
#define S10C0                            BANKMASK(LCDDATA1), 2
#define S10C1                            BANKMASK(LCDDATA7), 2
#define S10C2                            BANKMASK(LCDDATA13), 2
#define S10C3                            BANKMASK(LCDDATA19), 2
#define S10C4                            BANKMASK(LCDDATA25), 2
#define S10C5                            BANKMASK(LCDDATA31), 2
#define S10C6                            BANKMASK(LCDDATA37), 2
#define S10C7                            BANKMASK(LCDDATA43), 2
#define S11C0                            BANKMASK(LCDDATA1), 3
#define S11C1                            BANKMASK(LCDDATA7), 3
#define S11C2                            BANKMASK(LCDDATA13), 3
#define S11C3                            BANKMASK(LCDDATA19), 3
#define S11C4                            BANKMASK(LCDDATA25), 3
#define S11C5                            BANKMASK(LCDDATA31), 3
#define S11C6                            BANKMASK(LCDDATA37), 3
#define S11C7                            BANKMASK(LCDDATA43), 3
#define S13C0                            BANKMASK(LCDDATA1), 5
#define S13C1                            BANKMASK(LCDDATA7), 5
#define S13C2                            BANKMASK(LCDDATA13), 5
#define S13C3                            BANKMASK(LCDDATA19), 5
#define S13C4                            BANKMASK(LCDDATA25), 5
#define S13C5                            BANKMASK(LCDDATA31), 5
#define S13C6                            BANKMASK(LCDDATA37), 5
#define S13C7                            BANKMASK(LCDDATA43), 5
#define S14C0                            BANKMASK(LCDDATA1), 6
#define S14C1                            BANKMASK(LCDDATA7), 6
#define S14C2                            BANKMASK(LCDDATA13), 6
#define S14C3                            BANKMASK(LCDDATA19), 6
#define S14C4                            BANKMASK(LCDDATA25), 6
#define S14C5                            BANKMASK(LCDDATA31), 6
#define S14C6                            BANKMASK(LCDDATA37), 6
#define S14C7                            BANKMASK(LCDDATA43), 6
#define S15C0                            BANKMASK(LCDDATA1), 7
#define S15C1                            BANKMASK(LCDDATA7), 7
#define S15C2                            BANKMASK(LCDDATA13), 7
#define S15C3                            BANKMASK(LCDDATA19), 7
#define S15C4                            BANKMASK(LCDDATA25), 7
#define S15C5                            BANKMASK(LCDDATA31), 7
#define S15C6                            BANKMASK(LCDDATA37), 7
#define S15C7                            BANKMASK(LCDDATA43), 7
#define S18C0                            BANKMASK(LCDDATA2), 2
#define S18C1                            BANKMASK(LCDDATA8), 2
#define S18C2                            BANKMASK(LCDDATA14), 2
#define S18C3                            BANKMASK(LCDDATA20), 2
#define S18C4                            BANKMASK(LCDDATA26), 2
#define S18C5                            BANKMASK(LCDDATA32), 2
#define S18C6                            BANKMASK(LCDDATA38), 2
#define S18C7                            BANKMASK(LCDDATA44), 2
#define S19C0                            BANKMASK(LCDDATA2), 3
#define S19C1                            BANKMASK(LCDDATA8), 3
#define S19C2                            BANKMASK(LCDDATA14), 3
#define S19C3                            BANKMASK(LCDDATA20), 3
#define S19C4                            BANKMASK(LCDDATA26), 3
#define S19C5                            BANKMASK(LCDDATA32), 3
#define S19C6                            BANKMASK(LCDDATA38), 3
#define S19C7                            BANKMASK(LCDDATA44), 3
#define S2                               BANKMASK(SSP1STAT), 3
#define S20C0                            BANKMASK(LCDDATA2), 4
#define S20C1                            BANKMASK(LCDDATA8), 4
#define S20C2                            BANKMASK(LCDDATA14), 4
#define S20C3                            BANKMASK(LCDDATA20), 4
#define S20C4                            BANKMASK(LCDDATA26), 4
#define S20C5                            BANKMASK(LCDDATA32), 4
#define S20C6                            BANKMASK(LCDDATA38), 4
#define S20C7                            BANKMASK(LCDDATA44), 4
#define S22C0                            BANKMASK(LCDDATA2), 6
#define S22C1                            BANKMASK(LCDDATA8), 6
#define S22C2                            BANKMASK(LCDDATA14), 6
#define S22C3                            BANKMASK(LCDDATA20), 6
#define S22C4                            BANKMASK(LCDDATA26), 6
#define S22C5                            BANKMASK(LCDDATA32), 6
#define S22C6                            BANKMASK(LCDDATA38), 6
#define S22C7                            BANKMASK(LCDDATA44), 6
#define S23C0                            BANKMASK(LCDDATA2), 7
#define S23C1                            BANKMASK(LCDDATA8), 7
#define S23C2                            BANKMASK(LCDDATA14), 7
#define S23C3                            BANKMASK(LCDDATA20), 7
#define S23C4                            BANKMASK(LCDDATA26), 7
#define S23C5                            BANKMASK(LCDDATA32), 7
#define S23C6                            BANKMASK(LCDDATA38), 7
#define S23C7                            BANKMASK(LCDDATA44), 7
#define S24C0                            BANKMASK(LCDDATA3), 0
#define S24C1                            BANKMASK(LCDDATA9), 0
#define S24C2                            BANKMASK(LCDDATA15), 0
#define S24C3                            BANKMASK(LCDDATA21), 0
#define S24C4                            BANKMASK(LCDDATA27), 0
#define S24C5                            BANKMASK(LCDDATA33), 0
#define S24C6                            BANKMASK(LCDDATA39), 0
#define S24C7                            BANKMASK(LCDDATA45), 0
#define S25C0                            BANKMASK(LCDDATA3), 1
#define S25C1                            BANKMASK(LCDDATA9), 1
#define S25C2                            BANKMASK(LCDDATA15), 1
#define S25C3                            BANKMASK(LCDDATA21), 1
#define S25C4                            BANKMASK(LCDDATA27), 1
#define S25C5                            BANKMASK(LCDDATA33), 1
#define S25C6                            BANKMASK(LCDDATA39), 1
#define S25C7                            BANKMASK(LCDDATA45), 1
#define S26C0                            BANKMASK(LCDDATA3), 2
#define S26C1                            BANKMASK(LCDDATA9), 2
#define S26C2                            BANKMASK(LCDDATA15), 2
#define S26C3                            BANKMASK(LCDDATA21), 2
#define S26C4                            BANKMASK(LCDDATA27), 2
#define S26C5                            BANKMASK(LCDDATA33), 2
#define S26C6                            BANKMASK(LCDDATA39), 2
#define S26C7                            BANKMASK(LCDDATA45), 2
#define S27C0                            BANKMASK(LCDDATA3), 3
#define S27C1                            BANKMASK(LCDDATA9), 3
#define S27C2                            BANKMASK(LCDDATA15), 3
#define S27C3                            BANKMASK(LCDDATA21), 3
#define S27C4                            BANKMASK(LCDDATA27), 3
#define S27C5                            BANKMASK(LCDDATA33), 3
#define S27C6                            BANKMASK(LCDDATA39), 3
#define S27C7                            BANKMASK(LCDDATA45), 3
#define S28C0                            BANKMASK(LCDDATA3), 4
#define S28C1                            BANKMASK(LCDDATA9), 4
#define S28C2                            BANKMASK(LCDDATA15), 4
#define S28C3                            BANKMASK(LCDDATA21), 4
#define S28C4                            BANKMASK(LCDDATA27), 4
#define S28C5                            BANKMASK(LCDDATA33), 4
#define S28C6                            BANKMASK(LCDDATA39), 4
#define S28C7                            BANKMASK(LCDDATA45), 4
#define S29C0                            BANKMASK(LCDDATA3), 5
#define S29C1                            BANKMASK(LCDDATA9), 5
#define S29C2                            BANKMASK(LCDDATA15), 5
#define S29C3                            BANKMASK(LCDDATA21), 5
#define S29C4                            BANKMASK(LCDDATA27), 5
#define S29C5                            BANKMASK(LCDDATA33), 5
#define S29C6                            BANKMASK(LCDDATA39), 5
#define S29C7                            BANKMASK(LCDDATA45), 5
#define S30C0                            BANKMASK(LCDDATA3), 6
#define S30C1                            BANKMASK(LCDDATA9), 6
#define S30C2                            BANKMASK(LCDDATA15), 6
#define S30C3                            BANKMASK(LCDDATA21), 6
#define S30C4                            BANKMASK(LCDDATA27), 6
#define S30C5                            BANKMASK(LCDDATA33), 6
#define S30C6                            BANKMASK(LCDDATA39), 6
#define S30C7                            BANKMASK(LCDDATA45), 6
#define S31C0                            BANKMASK(LCDDATA3), 7
#define S31C1                            BANKMASK(LCDDATA9), 7
#define S31C2                            BANKMASK(LCDDATA15), 7
#define S31C3                            BANKMASK(LCDDATA21), 7
#define S31C4                            BANKMASK(LCDDATA27), 7
#define S31C5                            BANKMASK(LCDDATA33), 7
#define S31C6                            BANKMASK(LCDDATA39), 7
#define S31C7                            BANKMASK(LCDDATA45), 7
#define S32C0                            BANKMASK(LCDDATA4), 0
#define S32C1                            BANKMASK(LCDDATA10), 0
#define S32C2                            BANKMASK(LCDDATA16), 0
#define S32C3                            BANKMASK(LCDDATA22), 0
#define S32C4                            BANKMASK(LCDDATA28), 0
#define S32C5                            BANKMASK(LCDDATA34), 0
#define S32C6                            BANKMASK(LCDDATA40), 0
#define S32C7                            BANKMASK(LCDDATA46), 0
#define S33C0                            BANKMASK(LCDDATA4), 1
#define S33C1                            BANKMASK(LCDDATA10), 1
#define S33C2                            BANKMASK(LCDDATA16), 1
#define S33C3                            BANKMASK(LCDDATA22), 1
#define S33C4                            BANKMASK(LCDDATA28), 1
#define S33C5                            BANKMASK(LCDDATA34), 1
#define S33C6                            BANKMASK(LCDDATA40), 1
#define S33C7                            BANKMASK(LCDDATA46), 1
#define S34C0                            BANKMASK(LCDDATA4), 2
#define S34C1                            BANKMASK(LCDDATA10), 2
#define S34C2                            BANKMASK(LCDDATA16), 2
#define S34C3                            BANKMASK(LCDDATA22), 2
#define S34C4                            BANKMASK(LCDDATA28), 2
#define S34C5                            BANKMASK(LCDDATA34), 2
#define S34C6                            BANKMASK(LCDDATA40), 2
#define S34C7                            BANKMASK(LCDDATA46), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SE00                             BANKMASK(LCDSE0), 0
#define SE01                             BANKMASK(LCDSE0), 1
#define SE02                             BANKMASK(LCDSE0), 2
#define SE03                             BANKMASK(LCDSE0), 3
#define SE04                             BANKMASK(LCDSE0), 4
#define SE05                             BANKMASK(LCDSE0), 5
#define SE06                             BANKMASK(LCDSE0), 6
#define SE07                             BANKMASK(LCDSE0), 7
#define SE08                             BANKMASK(LCDSE1), 0
#define SE09                             BANKMASK(LCDSE1), 1
#define SE10                             BANKMASK(LCDSE1), 2
#define SE11                             BANKMASK(LCDSE1), 3
#define SE12                             BANKMASK(LCDSE1), 4
#define SE13                             BANKMASK(LCDSE1), 5
#define SE14                             BANKMASK(LCDSE1), 6
#define SE15                             BANKMASK(LCDSE1), 7
#define SE16                             BANKMASK(LCDSE2), 0
#define SE17                             BANKMASK(LCDSE2), 1
#define SE18                             BANKMASK(LCDSE2), 2
#define SE19                             BANKMASK(LCDSE2), 3
#define SE20                             BANKMASK(LCDSE2), 4
#define SE21                             BANKMASK(LCDSE2), 5
#define SE22                             BANKMASK(LCDSE2), 6
#define SE23                             BANKMASK(LCDSE2), 7
#define SE24                             BANKMASK(LCDSE3), 0
#define SE25                             BANKMASK(LCDSE3), 1
#define SE26                             BANKMASK(LCDSE3), 2
#define SE27                             BANKMASK(LCDSE3), 3
#define SE28                             BANKMASK(LCDSE3), 4
#define SE29                             BANKMASK(LCDSE3), 5
#define SE30                             BANKMASK(LCDSE3), 6
#define SE31                             BANKMASK(LCDSE3), 7
#define SE32                             BANKMASK(LCDSE4), 0
#define SE33                             BANKMASK(LCDSE4), 1
#define SE34                             BANKMASK(LCDSE4), 2
#define SE35                             BANKMASK(LCDSE4), 3
#define SE36                             BANKMASK(LCDSE4), 4
#define SE37                             BANKMASK(LCDSE4), 5
#define SE38                             BANKMASK(LCDSE4), 6
#define SE39                             BANKMASK(LCDSE4), 7
#define SE40                             BANKMASK(LCDSE5), 0
#define SE41                             BANKMASK(LCDSE5), 1
#define SE42                             BANKMASK(LCDSE5), 2
#define SE43                             BANKMASK(LCDSE5), 3
#define SE44                             BANKMASK(LCDSE5), 4
#define SE45                             BANKMASK(LCDSE5), 5
#define SE46                             BANKMASK(LCDSE5), 6
#define SE47                             BANKMASK(LCDSE5), 7
#define SECH0                            BANKMASK(SECONDS), 4
#define SECH1                            BANKMASK(SECONDS), 5
#define SECH2                            BANKMASK(SECONDS), 6
#define SECL0                            BANKMASK(SECONDS), 0
#define SECL1                            BANKMASK(SECONDS), 1
#define SECL2                            BANKMASK(SECONDS), 2
#define SECL3                            BANKMASK(SECONDS), 3
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLPEN                            BANKMASK(LCDCON), 6
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SLRD0                            BANKMASK(SLRCOND), 0
#define SLRD1                            BANKMASK(SLRCOND), 1
#define SLRD2                            BANKMASK(SLRCOND), 2
#define SLRD3                            BANKMASK(SLRCOND), 3
#define SLRD4                            BANKMASK(SLRCOND), 4
#define SLRD5                            BANKMASK(SLRCOND), 5
#define SLRD6                            BANKMASK(SLRCOND), 6
#define SLRD7                            BANKMASK(SLRCOND), 7
#define SLRE0                            BANKMASK(SLRCONE), 0
#define SLRE1                            BANKMASK(SLRCONE), 1
#define SLRE2                            BANKMASK(SLRCONE), 2
